src/Catalogs/КластерыСерверов/КластерыСерверов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КластерыСерверов</name>
  <attributes>
    <name>АдресСервераАдминистрирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераАдминистрирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортКластера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдминистраторКластера</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиАдминистрирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/КластерыСерверов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ПортСервераАдминистрирования) Тогда
		ПортСервераАдминистрирования = 1545;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПортКластера) Тогда
		ПортКластера = 1541;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ПроверитьДиапазонПорта(ПортСервераАдминистрирования, "ПортСервераАдминистрирования", Отказ);
	ПроверитьДиапазонПорта(ПортКластера, "ПортКластера", Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КластерыСерверов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КластерыСерверов КАК КластерыСерверов
		|ГДЕ
		|	КластерыСерверов.АдресСервераАдминистрирования = &АдресСервераАдминистрирования
		|	И КластерыСерверов.ПортСервераАдминистрирования = &ПортСервераАдминистрирования
		|	И КластерыСерверов.ПортКластера = &ПортКластера
		|	И КластерыСерверов.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("АдресСервераАдминистрирования", АдресСервераАдминистрирования);
	Запрос.УстановитьПараметр("ПортСервераАдминистрирования", ПортСервераАдминистрирования);
	Запрос.УстановитьПараметр("ПортКластера", ПортКластера);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Кластер с таким адресом RAS и портами уже существует.'"),
			ЭтотОбъект,
			"АдресСервераАдминистрирования",
			,
			Отказ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДиапазонПорта(Порт, ИмяРеквизита, Отказ)
	Если Порт < 1 Или Порт > 65535 Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Порт должен быть в диапазоне от 1 до 65535.'"),
			ЭтотОбъект,
			ИмяРеквизита,
			,
			Отказ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
